In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.arange(1, 25).reshape(8, 3), columns=['data1', 'data2', 'data3'])

In [3]:
df

   data1  data2  data3
0      1      2      3
1      4      5      6
2      7      8      9
3     10     11     12
4     13     14     15
5     16     17     18
6     19     20     21
7     22     23     24

In [ ]:
def func(x): # axis = 0 x -> a column 
        pass # axis = 1 x -> a row

Question. Add 3 to each element using df.apply?

In [23]:
f = lambda x: x+3
df.apply(func, axis=0) # axis value!! axis = 0 it applies the function f to each column

   data1  data2  data3
0      4      5      6
1      7      8      9
2     10     11     12
3     13     14     15
4     16     17     18
5     19     20     21
6     22     23     24
7     25     26     27

Question. Find the sum of each row using df.apply?

In [24]:
df

   data1  data2  data3
0      1      2      3
1      4      5      6
2      7      8      9
3     10     11     12
4     13     14     15
5     16     17     18
6     19     20     21
7     22     23     24

In [25]:
df.apply(lambda el: el.sum(), axis=0)

data1     92
data2    100
data3    108
dtype: int64

In [6]:
#df.apply(sum, axis=1)

0     6
1    15
2    24
3    33
4    42
5    51
6    60
7    69
dtype: int64

Question. Find the sum of each column using df.apply?

In [8]:
df.apply(sum) #default value of axis is 0

data1     92
data2    100
data3    108
dtype: int64

In [9]:
ds = pd.DataFrame({
    'col1': ['shubhamsss', 'nitishss', 'girish'],
    'col2': ['abhilasha', 'shivam', 'sravanthi'],
    'col3': ['prasang', 'aditya', 'ashish']
})

In [10]:
ds

         col1       col2     col3
0  shubhamsss  abhilasha  prasang
1    nitishss     shivam   aditya
2      girish  sravanthi   ashish

x !! is a series

In [26]:
f = lambda x: x.count('s')
ds.apply(f)

KeyError: ('Level s must be same as name (None)', 'occurred at index col1')

In [16]:
# count the occurrence of 's' in a series x
def func(x):
    res = []
    for name in x:
        res.append(name.count('s'))
    return res

In [28]:
f = lambda x: [name.count('s') for name in x] # x is a column (series)
ds.apply(func)

   col1  col2  col3
0     4     1     1
1     3     1     0
2     1     1     2

Question. Count the number of 's' in each element of the dataframe using df.apply?

In [11]:
f = lambda x: x.count('s') # x is a series --> row if axis=1/ column if axis=0
ds.apply(f)

KeyError: ('Level s must be same as name (None)', 'occurred at index col1')

In [12]:
# x is actually a series

In [13]:
pd.Series([1, 2, 3])+3 # lambda x: x+3

0    4
1    5
2    6
dtype: int64

In [30]:
pd.Series(['shivs', 'shivani', 'sid']).str.count('s')

0    2
1    1
2    1
dtype: int64

In [31]:
f2 = lambda x: x.str.count('s')
ds.apply(f2)

   col1  col2  col3
0     4     1     1
1     3     1     0
2     1     1     2

In [22]:
ds.applymap(lambda x: x.count('s')) #here x is EACH ELEMENT

   col1  col2  col3
0     4     1     1
1     3     1     0
2     1     1     2

### Pivot tables

In [37]:
titanic = pd.read_csv('train.csv')

In [38]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [40]:
groups = titanic.groupby('Sex')

In [41]:
groups.mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [45]:
titanic.groupby('Sex')[['Survived']].mean()

        Survived
Sex
female  0.742038
male    0.188908

In [47]:
titanic.groupby(['Sex', 'Pclass'])[['Survived']].mean()

               Survived
Sex    Pclass
female 1       0.968085
       2       0.921053
       3       0.500000
male   1       0.368852
       2       0.157407
       3       0.135447

In [48]:
titanic.groupby(['Sex', 'Pclass'])[['Survived']].mean().unstack()

        Survived
Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

## PIVOT

In [50]:
titanic.pivot_table(values='Survived', index='Sex', columns='Pclass')

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [71]:
titanic.pivot_table(values='Survived', index='Sex', columns='Pclass')

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [72]:
age = pd.cut(titanic['Age'], [0, 18, 80])
titanic.pivot_table(values='Survived', index=['Sex', age], columns='Pclass')

Pclass                  1         2         3
Sex    Age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

 pd.qcut 100 examples. 90 in one bin 
Divide into 10 bins
0, 10  # most of your examples in this bin 
10, 20
20, 30
...

0-10 , 10-100

In [60]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                          "bar", "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two", "two"],
                   "C": ["small", "large", "large", "small",
                          "small", "large", "small", "small",
                          "large", "small"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7, 8],
                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9, 12]})

In [61]:
df

     A    B      C  D   E
0  foo  one  small  1   2
1  foo  one  large  2   4
2  foo  one  large  2   5
3  foo  two  small  3   5
4  foo  two  small  3   6
5  bar  one  large  4   6
6  bar  one  small  5   8
7  bar  two  small  6   9
8  bar  two  large  7   9
9  bar  two  small  8  12

In [66]:
table = pd.pivot_table(df, values='D', index=['A'], columns=['B', 'C'], aggfunc=np.max)

In [67]:
table

B     one         two
C   large small large small
A
bar   4.0   5.0   7.0   8.0
foo   2.0   1.0   NaN   3.0

In [4]:
arr = np.array([1, 2, 3, 4, 100, 1019])
pd.qcut(arr, 2).value_counts()

(0.999, 3.5]     3
(3.5, 1019.0]    3
dtype: int64

In [84]:
nums = np.random.randint(10, 25, 100)
pd.qcut(nums, 4).value_counts()

(9.999, 13.0]    29
(13.0, 16.0]     23
(16.0, 20.0]     25
(20.0, 24.0]     23
dtype: int64

In [83]:
nums

array([24, 17, 24, 17, 13, 11, 24, 21, 22, 22, 13, 16, 21, 23, 16, 11, 18,
       18, 10, 15, 20, 12, 15, 22, 21, 20, 10, 13, 15, 23, 21, 15, 18, 14,
       16, 24, 13, 22, 13, 16, 19, 23, 14, 20, 20, 11, 13, 22, 10, 16, 23,
       13, 11, 11, 18, 22, 15, 16, 17, 18, 24, 20, 12, 14, 22, 20, 20, 19,
       22, 23, 24, 24, 21, 14, 17, 11, 14, 12, 18, 19, 11, 11, 11, 22, 14,
       12, 17, 16, 20, 12, 14, 17, 22, 11, 12, 18, 11, 14, 20, 15])

In [85]:
nums = np.random.normal(size=100)
pd.qcut(nums, 4).value_counts()

(-1.565, -0.372]    25
(-0.372, 0.191]     25
(0.191, 0.885]      25
(0.885, 2.165]      25
dtype: int64

In [95]:
arr = np.array([0.5, 1, 1, 1, 1, 1, 1, 1, 1, 2, 100, 101])
pd.qcut(arr, 2)

[(0.499, 1.0], (0.499, 1.0], (0.499, 1.0], (0.499, 1.0], (0.499, 1.0], ..., (0.499, 1.0], (0.499, 1.0], (1.0, 101.0], (1.0, 101.0], (1.0, 101.0]]
Length: 12
Categories (2, interval[float64]): [(0.499, 1.0] < (1.0, 101.0]]